results/aws-m5d.large-juicefs/reports/lcs.64k.fio.out
lcs_setup: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
lcs_64k_write: (g=1): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
lcs_64k_read: (g=1): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=8
fio-3.10-28-g9f2c
Starting 3 threads
lcs_setup: Laying out IO files (10 files / total 1600MiB)
lcs_64k_write: Laying out IO files (10 files / total 1600MiB)
lcs_64k_read: Laying out IO files (10 files / total 1600MiB)

lcs_setup: (groupid=0, jobs=1): err= 0: pid=3343: Mon Sep 24 12:04:09 2018
  write: IOPS=107, BW=6907KiB/s (7073kB/s)(71.7MiB/10628msec)
    slat (usec): min=38, max=543189, avg=1104.15, stdev=22292.58
    clat (usec): min=7, max=543676, avg=7751.11, stdev=58754.33
     lat (usec): min=328, max=543751, avg=8855.72, stdev=62782.48
    clat percentiles (usec):
     |  1.00th=[   302],  5.00th=[   338], 10.00th=[   351], 20.00th=[   383],
     | 30.00th=[   441], 40.00th=[   482], 50.00th=[   553], 60.00th=[   594],
     | 70.00th=[   693], 80.00th=[  1020], 90.00th=[  1696], 95.00th=[  3851],
     | 99.00th=[526386], 99.50th=[541066], 99.90th=[541066], 99.95th=[541066],
     | 99.99th=[541066]
   bw (  KiB/s): min=19968, max=125824, per=100.00%, avg=72896.00, stdev=74851.50, samples=2
   iops        : min=  312, max= 1966, avg=1139.00, stdev=1169.55, samples=2
  lat (usec)   : 10=0.09%, 500=42.98%, 750=28.77%, 1000=7.41%
  lat (msec)   : 2=12.12%, 4=3.84%, 10=1.74%, 20=1.22%, 50=0.61%
  lat (msec)   : 750=1.22%
  cpu          : usr=0.00%, sys=0.23%, ctx=2705, majf=0, minf=1
  IO depths    : 1=1.0%, 2=0.2%, 4=0.3%, 8=99.4%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1147,0,10 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
lcs_64k_write: (groupid=1, jobs=1): err= 0: pid=3344: Mon Sep 24 12:04:09 2018
  write: IOPS=1185, BW=74.1MiB/s (77.7MB/s)(4448MiB/60013msec)
    slat (usec): min=31, max=9876.5k, avg=839.59, stdev=39657.71
    clat (usec): min=7, max=9905.7k, avg=5902.45, stdev=105334.37
     lat (usec): min=51, max=9905.8k, avg=6742.59, stdev=112619.80
    clat percentiles (usec):
     |  1.00th=[   297],  5.00th=[   318], 10.00th=[   338], 20.00th=[   379],
     | 30.00th=[   412], 40.00th=[   437], 50.00th=[   469], 60.00th=[   502],
     | 70.00th=[   553], 80.00th=[   619], 90.00th=[  1385], 95.00th=[  4752],
     | 99.00th=[133694], 99.50th=[283116], 99.90th=[633340], 99.95th=[784335],
     | 99.99th=[977273]
   bw (  KiB/s): min=    6, max=8334732, per=100.00%, avg=133595.12, stdev=86402.94, samples=71164
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=71164
  lat (usec)   : 10=0.01%, 20=0.01%, 100=0.01%, 250=0.01%, 500=59.41%
  lat (usec)   : 750=25.85%, 1000=2.90%
  lat (msec)   : 2=3.07%, 4=2.83%, 10=2.89%, 20=0.65%, 50=0.67%
  lat (msec)   : 100=0.49%, 250=0.62%, 500=0.43%, 750=0.10%, 1000=0.05%
  cpu          : usr=0.49%, sys=1.01%, ctx=72923, majf=0, minf=2786
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,71164,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
lcs_64k_read: (groupid=1, jobs=1): err= 0: pid=3345: Mon Sep 24 12:04:09 2018
   read: IOPS=3136, BW=196MiB/s (206MB/s)(11.5GiB/60035msec)
    slat (usec): min=65, max=597269, avg=314.74, stdev=5005.81
    clat (usec): min=6, max=1111.9k, avg=2202.64, stdev=14057.96
     lat (usec): min=90, max=1208.0k, avg=2518.10, stdev=15365.58
    clat percentiles (usec):
     |  1.00th=[   510],  5.00th=[   562], 10.00th=[   570], 20.00th=[   586],
     | 30.00th=[   603], 40.00th=[   619], 50.00th=[   635], 60.00th=[   660],
     | 70.00th=[   693], 80.00th=[   750], 90.00th=[  1090], 95.00th=[  4047],
     | 99.00th=[ 30540], 99.50th=[ 71828], 99.90th=[229639], 99.95th=[308282],
     | 99.99th=[396362]
   bw (  KiB/s): min=   58, max=10176397, per=47.22%, avg=94770.68, stdev=51543.37, samples=188270
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=188270
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=79.83%, 1000=9.32%
  lat (msec)   : 2=3.92%, 4=1.87%, 10=2.23%, 20=1.33%, 50=0.77%
  lat (msec)   : 100=0.35%, 250=0.27%, 500=0.08%, 750=0.01%
  cpu          : usr=1.47%, sys=4.16%, ctx=192284, majf=0, minf=5423
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=188270,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=6907KiB/s (7073kB/s), 6907KiB/s-6907KiB/s (7073kB/s-7073kB/s), io=71.7MiB (75.2MB), run=10628-10628msec

Run status group 1 (all jobs):
   READ: bw=196MiB/s (206MB/s), 196MiB/s-196MiB/s (206MB/s-206MB/s), io=11.5GiB (12.3GB), run=60035-60035msec
  WRITE: bw=74.1MiB/s (77.7MB/s), 74.1MiB/s-74.1MiB/s (77.7MB/s-77.7MB/s), io=4448MiB (4664MB), run=60013-60013msec